{
    "chapters": [
        {
            "index": 1,
            "name": "导论",
            "type": "tree",
            "starting_page": 1,
            "ending_page": 20,
            "children": [
                {
                    "index": 1,
                    "name": "一、什么是马克思主义",
                    "type": "leaf",
                    "starting_page": 2,
                    "ending_page": 13,
                    "actual_starting_page": "page0011.txt",
                    "children": "",
                    "actual_ending_page": "page0022.txt",
                    "knowledge_points": [
                        "马克思主义是由马克思、恩格斯创立并为后继者所不断发展的科学理论体系。",
                        "马克思主义是关于自然、社会和人类思维发展一般规律的学说，是关于社会主义必然代替资本主义、最终实现共产主义的学说。",
                        "马克思主义是无产阶级政党和社会主义国家的指导思想，是指引人民创造美好生活的行动指南。",
                        "马克思主义哲学、马克思主义政治经济学和科学社会主义是其三个基本组成部分。",
                        "马克思主义基本原理是对马克思主义立场观点方法的集中概括，具有普遍真理性的理论。",
                        "马克思主义的基本立场是以无产阶级的解放和全人类的解放为己任，以人民为中心。",
                        "马克思主义的基本观点包括世界统一于物质、事物矛盾运动规律、实践和认识辩证关系等。",
                        "马克思主义的基本方法主要包括实事求是的方法、辩证分析的方法、社会基本矛盾和主要矛盾分析的方法等。",
                        "马克思主义产生于19世纪40年代，创始人是马克思和恩格斯，其产生具有深刻的社会根源、阶级基础和思想渊源。",
                        "马克思主义的创立与发展过程中，马克思和恩格斯通过不倦的理论求索和实践体验，实现了世界观和政治立场的彻底转变。",
                        "《共产党宣言》发表标志着马克思主义的公开问世。",
                        "列宁在领导俄国革命和建设的过程中，把马克思主义基本原理与俄国实际相结合，创立了列宁主义。",
                        "马克思主义中国化时代化是中国共产党人在不断探索中把马克思主义基本原理同中国具体实际相结合、同中华优秀传统文化相结合的过程。",
                        "毛泽东思想是马克思列宁主义在中国的创造性运用和发展，是马克思主义中国化时代化的第一次历史性飞跃。",
                        "中国特色社会主义理论体系包括邓小平理论、“三个代表”重要思想、科学发展观等，实现了马克思主义中国化时代化新的飞跃。",
                        "习近平新时代中国特色社会主义思想是对马克思列宁主义、毛泽东思想、邓小平理论、“三个代表”重要思想、科学发展观的继承和发展，是当代中国马克思主义、21世纪马克思主义。",
                        "马克思主义具有鲜明的科学性、人民性、实践性和发展性，这些特征体现了马克思主义的本质和使命。"
                    ]
                },
                {
                    "index": 2,
                    "name": "二、马克思主义的创立与发展",
                    "type": "tree",
                    "starting_page": 14,
                    "ending_page": 20,
                    "children": [
                        {
                            "index": 1,
                            "name": "（一）马克思主义的创立",
                            "type": "leaf",
                            "starting_page": 14,
                            "ending_page": 18,
                            "children": "",
                            "actual_starting_page": "page0023.txt",
                            "actual_ending_page": "page0027.txt",
                            "knowledge_points": [
                                "马克思主义理论是一个逻辑严密的有机整体，以事实为依据、以规律为对象，并以实践为检验标准。",
                                "人民性是马克思主义的本质属性，人民至上是其政治立场。马克思主义植根于人民之中，是来自人民、为了人民、造福人民的理论。",
                                "马克思主义的人民性是以阶级性为基础的，体现无产阶级的先进性。马克思主义是无产阶级的世界观和关于无产阶级解放的学说。",
                                "无产阶级解放和全人类解放完全一致，只有无产阶级才能领导全人类解放的伟大事业。",
                                "马克思主义政党把人民放在心中最高位置，致力于实现最广大人民的根本利益。",
                                "马克思主义是从实践中来、到实践中去、在实践中接受检验，并随实践而不断发展的学说。",
                                "马克思主义具有鲜明的实践品格，不仅致力于科学解释世界，而且致力于积极改变世界。",
                                "实践观点是马克思主义首要和基本的观点，体现在马克思主义全部思想内容之中。",
                                "马克思主义是不断发展的开放的学说，具有与时俱进的理论品质。",
                                "马克思主义理论体系是开放的，不断吸取人类最新的文明成果来充实和发展自己。",
                                "马克思主义的基本特征是科学性与革命性的统一。",
                                "马克思主义的革命性是建立在科学性基础上的，是与科学性高度统一的。",
                                "马克思主义给予我们观察当代世界的宏大视野，能够站在科学和时代的制高点上观察事物和现象。",
                                "马克思主义给予我们透视时代风云的锐利目光，善于透过现象看本质，从复杂现象中把握问题实质。",
                                "马克思主义给予我们展望未来世界的长远眼光和战略定力，能够看到变化脉络和演化趋势。",
                                "中国共产党坚持马克思主义基本原理，进行艰辛探索，不断推进马克思主义中国化时代化。",
                                "马克思主义是指引当代中国发展的精神旗帜，使中华民族在精神上从被动转为主动。",
                                "在中国共产党的领导下，中国人民取得了革命、建设、改革的伟大胜利，迎来了从站起来、富起来到强起来的伟大飞跃。"
                            ]
                        },
                        {
                            "index": 2,
                            "name": "（二）马克思主义的发展",
                            "type": "leaf",
                            "starting_page": 19,
                            "ending_page": 20,
                            "children": "",
                            "actual_starting_page": "page0028.txt",
                            "actual_ending_page": "page0029.txt",
                            "knowledge_points": [
                                "马克思主义是中国革命、建设、改革的强大精神动力。",
                                "中国共产党的初心和使命是为中国人民谋幸福，为中华民族谋复兴。",
                                "马克思主义是引领当代中国实践的行动指南，能够帮助思考和应对未来发展中的重大问题。",
                                "在马克思主义指导下，中国成功走上了全面建设社会主义现代化国家的道路。",
                                "马克思主义必须与时代特征结合，坚持理论创新和实践探索才能保持其生命力。",
                                "马克思主义所揭示的人类社会发展规律和资本主义基本矛盾仍然存在并发挥作用。",
                                "马克思主义仍然是当今时代的真理，人类社会面临的问题需要从马克思主义中寻找解决之道。"
                            ]
                        }
                    ],
                    "actual_starting_page": "page0023.txt",
                    "actual_ending_page": "page0029.txt"
                }
            ],
            "actual_starting_page": "page0010.txt",
            "actual_ending_page": "page0029.txt"
        },
        {
            "index": 2,
            "name": "第一章 世界的物质性及发展规律",
            "type": "tree",
            "starting_page": 25,
            "ending_page": 59,
            "children": [
                {
                    "index": 1,
                    "name": "第一节 世界的多样性与物质统一性",
                    "type": "leaf",
                    "starting_page": 26,
                    "ending_page": 38,
                    "children": "",
                    "actual_starting_page": "page0035.txt",
                    "actual_ending_page": "page0047.txt",
                    "knowledge_points": [
                        "世界的本质和物质统一性是哲学探讨的核心问题，辩证唯物主义认为物质是世界的基础。",
                        "物质和意识的关系构成了哲学的基本问题，包括谁为本原的问题和是否具有同一性的问题。",
                        "马克思主义的物质范畴是一个高度抽象的概念，指客观存在的各种事物的共同本质。",
                        "马克思主义的物质观坚持了唯物主义一元论，批判了不可知论，体现了唯物论和辩证法的统一。",
                        "物质的根本属性是运动，运动和静止是绝对和相对的关系。",
                        "时间和空间是物质运动的基本存在形式，物质运动总是在一定的时间和空间中进行。",
                        "物质世界通过人类实践活动分化出自然界与人类社会、客观世界与主观世界。",
                        "意识是物质世界长期发展的产物，是社会实践的产物，本质上是人脑的机能和属性。",
                        "意识对物质具有反作用，这种反作用表现在目的性、计划性、创造性以及指导实践改造客观世界等方面。",
                        "正确发挥人的主观能动性需要尊重客观规律，从实际出发，通过实践实现。",
                        "人工智能是对人类智能的模拟和扩展，但无法真正具备人类的情感、信念、意志等意识形式。",
                        "世界的统一性在于其物质性，马克思主义认为万事万物都有共同的本质或本原。"
                    ]
                },
                {
                    "index": 2,
                    "name": "第二节 事物的普遍联系和变化发展",
                    "type": "leaf",
                    "starting_page": 40,
                    "ending_page": 50,
                    "children": "",
                    "actual_starting_page": "page0049.txt",
                    "actual_ending_page": "page0059.txt",
                    "knowledge_points": [
                        "世界上的一切事物都不是孤立存在的，而是处在普遍联系和变化发展之中。",
                        "唯物辩证法认为，世界上的万事万物都处于普遍联系之中，普遍联系引起事物的变化发展。",
                        "联系是指事物内部各要素之间和事物之间相互影响、相互制约、相互作用的关系。",
                        "联系具有客观性，即事物的联系是事物本身所固有的、不以人的意志为转移的。",
                        "联系具有普遍性，任何事物内部的不同部分和要素之间都是相互联系的，整个世界是相互联系的统一整体。",
                        "联系具有多样性，事物之间的联系包括直接联系与间接联系、内部联系与外部联系、本质联系与非本质联系、必然联系与偶然联系等。",
                        "联系具有条件性，条件对事物发展和人的活动具有支持或制约作用，条件是可以改变的，但必须尊重事物发展的客观规律。",
                        "世界上的各种事物不仅是普遍联系的，而且是变化发展的，事物的相互联系构成了运动、变化和发展。",
                        "物质世界的发展实质是新事物的产生和旧事物的灭亡，新事物是指合乎历史前进方向、具有远大前途的东西，旧事物是指丧失历史必然性、日趋灭亡的东西。",
                        "对立统一规律是唯物辩证法的实质和核心，揭示了事物普遍联系的根本内容和变化发展的内在动力。",
                        "矛盾是反映事物内部或事物之间对立统一关系的哲学范畴，矛盾的同一性和斗争性相互联结、相辅相成。",
                        "矛盾的同一性是指矛盾着的对立面相互依存、相互贯通的性质和趋势，矛盾的斗争性是矛盾着的对立面相互排斥、相互分离的性质和趋势。",
                        "矛盾的普遍性是指矛盾存在于一切事物中，存在于一切事物发展过程的始终。",
                        "矛盾的特殊性是指各个具体事物的矛盾、每一个矛盾的各个方面在发展的不同阶段上各有其特点。",
                        "主要矛盾是矛盾体系中处于支配地位、对事物发展起决定作用的矛盾，次要矛盾是矛盾体系中处于从属地位、对事物发展起次要作用的矛盾。",
                        "量变是事物数量的增减和组成要素排列次序的变动，质变是事物性质的根本变化。",
                        "量变和质变是相互依存、相互贯通的，量变引起质变，在新质的基础上，事物又开始新的量变。",
                        "否定之否定规律揭示了事物自己发展自己的完整过程及本质，事物的发展是通过其内在矛盾运动以自我否定的方式而实现的。",
                        "辩证否定观要求我们对待一切事物都要采取科学分析的态度，既要把握住它的现存状态又要把握住它的发展趋向。",
                        "否定之否定规律揭示了事物发展的前进性与曲折性的统一，事物的发展不是直线式前进，而是螺旋式上升的。"
                    ]
                },
                {
                    "index": 3,
                    "name": "第三节 唯物辩证法是认识世界和改造世界的根本方法",
                    "type": "leaf",
                    "starting_page": 54,
                    "ending_page": 59,
                    "children": "",
                    "actual_starting_page": "page0063.txt",
                    "actual_ending_page": "page0068.txt",
                    "knowledge_points": [
                        "唯物辩证法不仅提供丰富的内容，还提供了其本质和精神，特别是其认识功能和方法论意义。",
                        "唯物辩证法本质上是批判的和革命的，它揭示了现存事物的必然灭亡，并从不断的运动中理解事物的暂时性。",
                        "马克思、恩格斯对资本主义的批判体现了唯物辩证法的批判性和革命性，反对把资本主义看作永恒范畴。",
                        "在社会主义条件下，要坚持解放思想、实事求是、与时俱进，用发展着的马克思主义指导新的实践。",
                        "唯物辩证法是客观辩证法与主观辩证法的统一，既包含客观事物的辩证运动和发展规律，也包含人类认识和思维运动的辩证法。",
                        "主观辩证法是客观辩证法在人的思维中的反映，二者在本质上是统一的，但在表现形式上不同。",
                        "唯物辩证法的一系列规律和范畴，既是科学的世界观，也是我们认识世界和改造世界的基本方法论。",
                        "对立统一规律为人们的认识活动提供了方法上的遵循，量变质变规律和否定之否定规律对科学研究有重要指导作用。",
                        "矛盾分析方法是对立统一规律在方法论上的体现，要求具体问题具体分析，善于认识和化解矛盾。",
                        "坚持问题导向是马克思主义永葆生机活力的奥秘所在，要善于抓住化解矛盾的着力点，找到解决矛盾的新思路新办法。",
                        "辩证思维方法与现代科学思维方法相互联系、相互补充，辩证思维是现代科学思维的方法论前提。",
                        "学习和掌握唯物辩证法的科学思维方法，要求我们在实践中不断增强辩证思维能力、历史思维能力、系统思维能力、战略思维能力、底线思维能力和创新思维能力。"
                    ]
                }
            ],
            "actual_starting_page": "page0034.txt",
            "actual_ending_page": "page0068.txt"
        },
        {
            "index": 3,
            "name": "第二章 实践与认识及其发展规律",
            "type": "tree",
            "starting_page": 69,
            "ending_page": 118,
            "children": [
                {
                    "index": 1,
                    "name": "第一节 实践与认识",
                    "type": "leaf",
                    "starting_page": 70,
                    "ending_page": 89,
                    "children": "",
                    "actual_starting_page": "page0079.txt",
                    "actual_ending_page": "page0098.txt",
                    "knowledge_points": [
                        "实践是人类能动地改造世界的社会性的物质活动，具有客观实在性、自觉能动性和社会历史性三个基本特征。",
                        "马克思科学阐明了人类实践的本质和作用，创立了科学的实践观，强调全部社会生活在本质上是实践的。",
                        "科学实践观克服了旧唯物主义的根本缺陷，为辩证唯物主义的创立奠定了科学的理论基础。",
                        "实践对认识具有决定作用，是认识的基础，实践在认识活动中起着决定性的作用。",
                        "认识的本质是主体在实践基础上对客体的能动反映，这是辩证唯物主义认识论对认识本质的科学回答。",
                        "人的认识过程是一个在实践基础上不断深化的发展过程，表现为从感性认识到理性认识，再从理性认识到实践的具体认识过程。",
                        "从实践到认识的过程主要表现为在实践基础上认识活动由感性认识能动地飞跃到理性认识。",
                        "理性认识依赖于感性认识，感性认识有待于发展和深化为理性认识，二者相互渗透、相互包含。",
                        "从认识到实践的飞跃是更为重要的飞跃，其必要性和重要性在于认识世界的目的是改造世界。",
                        "实践与认识的辩证运动是一个由感性认识到理性认识，又由理性认识到实践的飞跃，是实践、认识、再实践、再认识，循环往复以至无穷的辩证发展过程。"
                    ]
                },
                {
                    "index": 2,
                    "name": "第二节 真理与价值",
                    "type": "leaf",
                    "starting_page": 91,
                    "ending_page": 102,
                    "children": "",
                    "actual_starting_page": "page0100.txt",
                    "actual_ending_page": "page0111.txt",
                    "knowledge_points": [
                        "真理是主观认识与客观实践的具体的历史的统一，反对一切离开具体历史的‘左’的或右的错误思想。",
                        "人们通过实践追求真理和创造价值，既要遵循事物的本质和规律，又要符合人自身的尺度和需要。",
                        "真理是标志主观与客观相符合的哲学范畴，是对客观事物及其规律的正确反映。",
                        "马克思主义真理观认为真理与客观事物之间的符合关系是建立在人类能动地改造客观世界的实践基础上的。",
                        "真理具有客观性，其内容是对客观事物及其规律的正确反映，但形式上是主观的。",
                        "真理的一元性是指在同一条件下对于特定的认识客体的真理性认识只有一个，而不可能有多个。",
                        "真理既具有绝对性又具有相对性，它们是同一客观真理的两种属性。",
                        "真理的绝对性指真理主客观统一的确定性和发展的无限性，真理的相对性指人们在一定条件下对客观事物及其本质和发展规律的正确认识总是有限度的、不完善的。",
                        "真理的绝对性与相对性相互依存，任何真理都既是绝对的又是相对的。",
                        "真理与谬误是人类认识中的一对永恒矛盾，它们之间既对立又统一。",
                        "真理与谬误在一定条件下能够相互转化，真理在超出一定范围或失去特定条件时会变成谬误，谬误在一定条件下也能转化为真理。",
                        "实践是检验真理的唯一标准，这是由真理的本性和实践的特点决定的。",
                        "实践标准既有确定性又有不确定性，实践作为检验真理的标准具有唯一性、归根到底性、最终性，但同时也受到主客观条件的制约。",
                        "真理与价值的辩证统一要求人们在改造世界的过程中，不仅关注主观符合客观的真理问题，还要关注按照主体需要认识和改造世界的价值问题。"
                    ]
                },
                {
                    "index": 3,
                    "name": "第三节 认识世界和改造世界",
                    "type": "leaf",
                    "starting_page": 109,
                    "ending_page": 118,
                    "children": "",
                    "actual_starting_page": "page0118.txt",
                    "actual_ending_page": "page0127.txt",
                    "knowledge_points": [
                        "真理与价值或真理尺度与价值尺度是紧密联系、不可分割的辩证统一关系。",
                        "价值尺度必须以真理为前提，脱离了真理尺度，价值尺度就偏离了合理的、正确的轨道。",
                        "人类自身需要的内在尺度推动着人们不断发现新的真理。",
                        "真理尺度与价值尺度的统一是具体的、历史的，会随着实践的发展而不断发展到更高级的程度。",
                        "新时代中国特色社会主义的伟大实践体现了真理尺度与价值尺度的辩证统一。",
                        "认识世界和改造世界是相辅相成、辩证统一的。",
                        "认识世界有助于改造世界，正确认识世界是有效改造世界的必要前提。",
                        "只有在改造世界的实践中才能不断地深化、拓展对世界的正确认识。",
                        "主观和客观的矛盾是人类认识和实践活动中的基本矛盾，也是人类认识世界和改造世界的根本动力。",
                        "认识世界和改造世界统一的基础是实践。",
                        "改造客观世界和改造主观世界是辩证统一的，二者相辅相成、相互促进、缺一不可。",
                        "马克思主义认为，自由是指人在活动中通过认识和利用必然所表现出的一种自觉自主的状态。",
                        "实现自由的条件包括认识条件和实践条件。",
                        "自由总体上包含人与自然关系中的自由、人与社会关系中的自由、人与自身关系中的自由。",
                        "认识必然和争取自由是人类认识世界和改造世界的根本目标，是一个历史性的过程。",
                        "一切从实际出发是马克思主义认识论的根本要求。",
                        "实事求是是中国共产党思想路线的核心，其基本内涵是一切从实际出发，理论联系实际，在实践中检验和发展真理。",
                        "坚持实事求是，关键在于探求和掌握事物发展的规律。",
                        "守正创新深刻揭示了坚持真理与发展真理、坚持马克思主义与发展马克思主义的辩证关系。",
                        "守正是创新的基本前提，也是创新的可靠保障。"
                    ]
                }
            ],
            "actual_starting_page": "page0078.txt",
            "actual_ending_page": "page0127.txt"
        },
        {
            "index": 4,
            "name": "第三章 人类社会及其发展规律",
            "type": "tree",
            "starting_page": 123,
            "ending_page": 179,
            "children": [
                {
                    "index": 1,
                    "name": "第一节 人类社会的存在与发展",
                    "type": "leaf",
                    "starting_page": 124,
                    "ending_page": 149,
                    "children": "",
                    "actual_starting_page": "page0133.txt",
                    "actual_ending_page": "page0158.txt",
                    "knowledge_points": [
                        "马克思主义的唯物史观对人类社会的发展规律作出了科学解答。",
                        "社会存在与社会意识的关系问题是社会历史观的基本问题，正确认识这一关系是把握社会发展规律的基础。",
                        "唯物史观认为物质生活的生产方式制约着整个社会生活、政治生活和精神生活的过程。",
                        "社会存在是指社会物质生活条件，主要包括自然地理环境、人口因素和物质生产方式。",
                        "自然地理环境是人类社会生存和发展永恒的、必要的条件，对劳动生产率和社会发展有重要影响。",
                        "人口因素对社会发展具有影响和制约作用，适度的人口对社会发展起加速作用。",
                        "物质生产方式是社会存在和发展的基础及决定力量，决定社会的结构、性质和面貌。",
                        "社会意识是社会存在的反映，包括个体意识和群体意识、社会心理和社会意识形式。",
                        "意识形态反映一定经济关系、政治关系以及阶级或社会集团的利益和要求。",
                        "社会存在决定社会意识，社会意识是社会存在的反映，并反作用于社会存在。",
                        "社会意识具有相对独立性，表现为与社会存在发展的不完全同步性和不平衡性。",
                        "社会意识对社会存在具有能动的反作用，先进或落后的社会意识分别对社会发展起促进或阻碍作用。",
                        "社会存在和社会意识辩证关系原理对于树立科学历史观、认识社会历史具有重要意义。",
                        "生产力与生产关系、经济基础与上层建筑之间的矛盾是人类社会基本矛盾。",
                        "生产力是人类在生产实践中形成的改造和影响自然以使其适合社会需要的物质力量。",
                        "生产力的基本要素包括劳动资料、劳动对象和劳动者。",
                        "科学技术是生产力中的重要因素，是先进生产力的集中体现和主要标志。",
                        "生产关系是人们在物质生产过程中形成的不以人的意志为转移的经济关系。",
                        "生产关系区分为两种基本类型：以生产资料公有制为基础的生产关系和以生产资料私有制为基础的生产关系。",
                        "生产力决定生产关系，而生产关系又反作用于生产力。",
                        "经济基础与上层建筑矛盾运动的规律是人类社会发展的另一个基本规律。",
                        "经济基础决定上层建筑，上层建筑反作用于经济基础。",
                        "交往是人类实践活动的重要组成部分，对生产力的发展、社会关系的进步、文化的发展与传播以及人的全面发展都有重要作用。",
                        "世界历史是指各民族、国家通过普遍交往，打破孤立隔绝的状态，进入相互依存、相互联系的世界整体化的历史。",
                        "世界历史的形成和发展为共产主义的实现提供了条件和路径。",
                        "社会进步促进人的发展，社会形态更替既遵循一般规律，又具有一些特殊形式。",
                        "社会形态是同生产力发展一定阶段相适应的经济基础与上层建筑的统一体。",
                        "社会形态更替的统一性和多样性根源于社会发展的必然性与人们的主观选择性相统一的过程。",
                        "文明是人类创造的所有物质成果、精神成果和制度成果的总和，反映了社会进步程度。"
                    ]
                },
                {
                    "index": 2,
                    "name": "第二节 社会历史发展的动力",
                    "type": "leaf",
                    "starting_page": 151,
                    "ending_page": 166,
                    "children": "",
                    "actual_starting_page": "page0160.txt",
                    "actual_ending_page": "page0175.txt",
                    "knowledge_points": [
                        "文明形态是人类文明的存在形式或呈现样态，可以从时间维度和空间维度进行划分。",
                        "社会基本矛盾是推动历史发展的根本动力，包括生产力与生产关系、经济基础与上层建筑的矛盾。",
                        "生产力是社会基本矛盾运动中最基本的动力因素，决定着社会的发展方向。",
                        "社会基本矛盾中的生产力与生产关系、经济基础与上层建筑之间的矛盾，决定了其他社会矛盾的存在和发展。",
                        "社会主要矛盾是在社会发展过程中起主导作用的矛盾，其存在和发展规定或影响着非主要矛盾。",
                        "阶级斗争是阶级社会发展的直接动力，通过阶级斗争可以实现社会形态的更替。",
                        "革命是解决社会基本矛盾、促进社会进步的重要手段，尤其在阶级社会中表现为社会形态更替的关键。",
                        "改革是对生产关系和上层建筑进行深刻改变和革新，是社会制度自我调整和完善的过程。",
                        "科学技术作为先进生产力的重要标志，对社会经济发展具有巨大推动作用。",
                        "正确把握科学技术的社会作用需要合理社会制度保障，确保科技为人类社会健康发展服务。"
                    ]
                },
                {
                    "index": 3,
                    "name": "第三节 人民群众在历史发展中的作用",
                    "type": "leaf",
                    "starting_page": 169,
                    "ending_page": 179,
                    "children": "",
                    "actual_starting_page": "page0178.txt",
                    "actual_ending_page": "page0188.txt",
                    "knowledge_points": [
                        "唯物史观认为人民群众是历史的创造者，强调人民群众在社会发展中的决定性作用。",
                        "英雄史观与群众史观是对立的，英雄史观否认人民群众的历史作用，而群众史观认为历史的创造者是人民群众。",
                        "唯物史观从现实的人及其本质、整体的社会历史过程、社会历史发展的必然性以及人与历史关系的不同层次来考察谁是历史的创造者。",
                        "人民群众是社会物质财富和精神财富的创造者，同时也是社会变革的决定力量。",
                        "人民群众创造历史的活动受到经济条件、政治条件和精神文化条件的制约。",
                        "无产阶级政党的群众路线包括一切为了群众，一切依靠群众，从群众中来，到群众中去。",
                        "个人在历史上的作用存在差别，杰出人物对历史发展有深刻影响，但其作用受社会发展客观规律的制约。",
                        "评价历史人物时应坚持历史分析方法和阶级分析方法，既要肯定他们的历史功绩，也要指出他们的局限性和错误。",
                        "群众、阶级、政党、领袖的关系需要正确认识和处理，以更好地发挥无产阶级政党的领导作用。"
                    ]
                }
            ],
            "actual_starting_page": "page0132.txt",
            "actual_ending_page": "page0188.txt"
        },
        {
            "index": 5,
            "name": "第四章 资本主义的本质及规律",
            "type": "tree",
            "starting_page": 182,
            "ending_page": 232,
            "children": [
                {
                    "index": 1,
                    "name": "第一节 商品经济和价值规律",
                    "type": "leaf",
                    "starting_page": 183,
                    "ending_page": 193,
                    "children": "",
                    "actual_starting_page": "page0192.txt",
                    "actual_ending_page": "page0202.txt",
                    "knowledge_points": [
                        "商品是资本主义经济的细胞，马克思通过揭示商品经济的基本规律即价值规律，为揭开资本主义剥削的秘密奠定了科学基础。",
                        "商品经济的发展经历了简单商品经济与发达商品经济两个阶段。简单商品经济以生产资料私有制和个体劳动为基础；资本主义商品经济以生产资料私有制和雇佣劳动为基础。",
                        "商品经济产生的社会历史条件有两个：一是存在社会分工，二是生产资料和劳动产品属于不同的所有者。",
                        "商品是用来交换、能满足人的某种需要的劳动产品，具有使用价值和价值两个因素或两种属性，是使用价值和价值的矛盾统一体。",
                        "商品的价值是凝结在商品中的无差别的一般人类劳动，价值是商品所特有的社会属性。",
                        "商品的使用价值和价值之间是对立统一的关系。要获得商品的价值，就必须放弃商品的使用价值；要得到商品的使用价值，就不能得到商品的价值。",
                        "生产商品的劳动具有二重性，即具体劳动和抽象劳动。具体劳动创造商品的使用价值，抽象劳动形成商品的价值。",
                        "商品的价值量是由劳动者生产商品所耗费的劳动量决定的，而劳动量则按照劳动时间来计量。决定商品价值量的是社会必要劳动时间。",
                        "货币是在长期交换过程中形成的固定充当一般等价物的商品，是商品经济内在矛盾发展的产物，货币的本质体现一种社会关系。",
                        "价值规律是商品生产和商品交换的基本规律，主要表现为商品的价值量由生产商品的社会必要劳动时间决定，商品交换以价值量为基础，按照等价交换的原则进行。",
                        "价值规律在市场配置资源过程中的作用包括自发地调节生产资料和劳动力在社会各生产部门之间的分配比例、刺激社会生产力的发展以及调节社会收入的分配。",
                        "私人劳动和社会劳动的矛盾是商品经济的基本矛盾，这一矛盾贯穿商品经济发展过程的始终，决定着商品经济的各种内在矛盾及其发展趋势。",
                        "商品世界的拜物教性质掩盖了商品经济关系的本质，妨碍人们透过物的外表认识商品、价值以及货币的实质。",
                        "在资本主义制度下，私人劳动和社会劳动之间的矛盾进一步发展成资本主义的基本矛盾，即生产社会化和生产资料资本主义私人占有之间的矛盾。"
                    ]
                },
                {
                    "index": 2,
                    "name": "第二节 资本主义经济制度",
                    "type": "leaf",
                    "starting_page": 198,
                    "ending_page": 222,
                    "children": "",
                    "actual_starting_page": "page0207.txt",
                    "actual_ending_page": "page0231.txt",
                    "knowledge_points": [
                        "资本主义制度是人类历史上一种新的剥削制度。",
                        "社会形态的演进和更替是生产力与生产关系、经济基础与上层建筑矛盾发展的必然结果。",
                        "原始社会的生产力水平低下，生产资料归氏族公社所有，实行集体劳动，生活资料平均分配。",
                        "奴隶社会是第一个阶级剥削社会，奴隶主占有绝大部分生产资料并控制国家政权。",
                        "封建社会的生产关系以封建主占有土地等生产资料和不完全占有农民为基本特征。",
                        "资本主义生产关系是从封建社会的经济结构中产生的。",
                        "资本主义萌芽于14世纪末15世纪初地中海沿岸的一些城市，主要通过小商品经济分化和商人及高利贷者转化而来。",
                        "资本原始积累是指以暴力手段使生产者与生产资料相分离，资本迅速集中于少数人手中的过程。",
                        "资本主义所有制的确立意味着资本家拥有生产资料的所有权，劳动者与生产资料相分离，形成雇佣劳动关系。",
                        "劳动力成为商品的基本条件是劳动者在法律上自由且没有生产资料，不得不依靠出卖劳动力为生。",
                        "劳动力的价值由维持和发展劳动力所必需的生活资料的价值决定。",
                        "剩余价值是由雇佣工人的剩余劳动创造并被资本家无偿占有的超过劳动力价值的部分。",
                        "资本分为不变资本和可变资本，不变资本用于生产资料，可变资本用于购买劳动力。",
                        "剩余价值率表示资本家对工人的剥削程度，计算公式为m' = m/v。",
                        "绝对剩余价值是在必要劳动时间不变的情况下，通过延长工作日或提高劳动强度而生产的剩余价值。",
                        "相对剩余价值是在工作日长度不变的情况下，通过缩短必要劳动时间而生产的剩余价值。",
                        "资本积累是将剩余价值转化为资本的过程，其源泉是剩余价值。",
                        "资本有机构成的提高导致相对过剩人口的产生，即劳动力供给超过资本的需求。",
                        "资本循环是资本从一种形式出发，经过一系列形式的变化，又回到原来出发点的运动。",
                        "资本周转是指资本周而复始、不断反复的循环，影响因素包括资本周转时间和生产资本的构成。",
                        "资本主义工资的本质是劳动力的价值或价格，掩盖了资本主义的剥削关系。",
                        "利润是剩余价值的一种转化形式，利润率反映了预付总资本的增殖程度。",
                        "平均利润率是不同部门资本家要求按照等量资本获得等量利润的原则瓜分剩余价值的结果。",
                        "生产价格是商品价值的转化形式，是生产成本与平均利润之和。",
                        "剩余价值理论揭示了资本主义生产关系的剥削本质，阐明了无产阶级革命的历史必然性。",
                        "资本主义基本矛盾是生产社会化和生产资料资本主义私人占有之间的矛盾。"
                    ]
                },
                {
                    "index": 3,
                    "name": "第三节 资本主义上层建筑",
                    "type": "leaf",
                    "starting_page": 225,
                    "ending_page": 232,
                    "children": "",
                    "actual_starting_page": "page0234.txt",
                    "actual_ending_page": "page0241.txt",
                    "knowledge_points": [
                        "资本主义上层建筑包括政治上层建筑和观念上层建筑，前者体现为资本主义政治制度，后者主要体现为资本主义意识形态。",
                        "资本主义政治制度建立在资本主义经济基础之上，反映了资产阶级的要求，并保护和发展其经济基础。",
                        "资本主义国家的职能分为对内和对外两个方面，对内实行政治统治和社会管理，对外进行国际交往和维护国家安全及利益。",
                        "资本主义国家本质上是资产阶级进行阶级统治的工具，虽然在形式上追求自由、民主、平等、人权，但实际并未改变剥削和压迫的本质。",
                        "资本主义法律制度的核心是宪法，规定了国家的社会、经济和政治制度以及公民的权利与义务，基本原则包括私有制原则、主权在民原则、分权制衡原则和人权原则。",
                        "资本主义国家政权采取分权制衡的组织形式，即立法权、行政权、司法权分别由三个权力主体独立行使，形成相互制衡。",
                        "资本主义国家的选举制度是协调统治阶级内部利益关系和矛盾的重要措施，通过竞选产生议会和国家元首。",
                        "资本主义政党制度主要有两党制和多党制，其实质是资产阶级选择自己的国家管理者、实现内部利益平衡的政治机制。",
                        "资本主义政治制度在其历史发展进程中积累了丰富的政治统治和社会管理经验，推动了社会进步，但也存在金钱操纵下的民主、法律名义上的平等掩盖事实上的不平等、政党恶斗导致决策效率低下等问题。",
                        "资本主义意识形态是在资本主义国家中占统治地位的各种思想理论和观念的总和，核心思想主要是私有制神圣不可侵犯和个人主义价值观。"
                    ]
                }
            ],
            "actual_starting_page": "page0191.txt",
            "actual_ending_page": "page0241.txt"
        },
        {
            "index": 6,
            "name": "第五章 资本主义的发展及其趋势",
            "type": "tree",
            "starting_page": 236,
            "ending_page": 270,
            "children": [
                {
                    "index": 1,
                    "name": "第一节 垄断资本主义的形成与发展",
                    "type": "leaf",
                    "starting_page": 237,
                    "ending_page": 252,
                    "children": "",
                    "actual_starting_page": "page0246.txt",
                    "actual_ending_page": "page0261.txt",
                    "knowledge_points": [
                        "资本主义经历了自由竞争资本主义和垄断资本主义两个阶段。",
                        "19世纪70年代以前，资本主义处于自由竞争阶段；从19世纪70年代开始，逐步向垄断资本主义发展。",
                        "私人垄断资本主义是在生产集中和资本集中的基础上形成的。",
                        "自由竞争引起生产集中和资本集中，最终导致垄断。",
                        "垄断是指少数大企业通过协议或联合对商品的生产、销售和价格进行操纵和控制。",
                        "垄断组织的形式多种多样，但本质上都是通过联合实现独占和瓜分市场，以获取高额垄断利润。",
                        "垄断条件下竞争的特点包括竞争目的、手段和范围的变化。",
                        "金融资本是由工业垄断资本和银行垄断资本融合而成的一种新型垄断资本。",
                        "金融寡头通过参与制在经济领域中统治，并通过个人联合等方式控制国家政权。",
                        "垄断利润主要通过垄断价格来实现，垄断价格分为垄断高价和垄断低价。",
                        "国家垄断资本主义是国家政权和私人垄断资本融合在一起的垄断资本主义。",
                        "国家垄断资本主义的主要形式包括国家所有并直接经营企业、国家与私人共有合营企业等。",
                        "国家垄断资本主义对资本主义经济发展产生了积极的作用，但并未根本改变垄断资本主义的性质。",
                        "金融垄断资本的发展推动了资本主义经济的金融化程度不断提高。",
                        "垄断资本向世界范围扩展的基本形式有借贷资本输出、生产资本输出和商品资本输出。",
                        "跨国公司是垄断资本向世界范围扩展的重要国际垄断组织形式。",
                        "垄断资本主义的实质是垄断资本凭借垄断地位获取高额垄断利润。",
                        "经济全球化是指世界各国、各地区的经济活动相互联系、相互依存的过程。",
                        "经济全球化的表现包括生产全球化、贸易全球化、金融全球化等方面。"
                    ]
                },
                {
                    "index": 2,
                    "name": "第二节 正确认识当代资本主义的新变化",
                    "type": "leaf",
                    "starting_page": 257,
                    "ending_page": 267,
                    "children": "",
                    "actual_starting_page": "page0266.txt",
                    "actual_ending_page": "page0276.txt",
                    "knowledge_points": [
                        "第二次世界大战后，资本主义生产资料所有制发生了新的变化，国家资本所有制和法人资本所有制成为主导形式。",
                        "劳资关系和分配关系的变化包括职工参与决策、终身雇佣和职工持股等制度，这些制度旨在缓和劳资矛盾并提高工人生产积极性。",
                        "社会阶层和阶级结构的变化表现为资本家的地位和作用发生变化，高级职业经理成为大公司经营活动的实际控制者，知识型和服务型劳动者的数量不断增加。",
                        "经济调节机制和经济危机形态的变化体现在政府对经济的全面干预以及经济危机呈现的新特点，如去工业化、产业空心化、金融化等。",
                        "政治制度的变化表现为公民权利扩大、法治建设加强及改良主义政党在政治舞台上的影响日益扩大。",
                        "科学技术革命和生产力的发展是推动资本主义发生变化的根本动力，促进了产业结构的改善和经济快速发展。",
                        "工人阶级争取自身权利和利益的斗争是推动资本主义变化的重要力量，通过罢工等形式迫使资产阶级作出让步。",
                        "社会主义制度初步显示的优越性对资本主义产生了重要影响，促使资产阶级进行某些社会改革以应对挑战。",
                        "主张改良主义的政党对资本主义制度的改革也在一定程度上调整了资本主义生产关系，修补了传统资本主义经济运行机制的缺陷。",
                        "第二次世界大战后资本主义发生的变化并未改变其本质，资本主义的基本矛盾依然存在。",
                        "进入21世纪以来，科技创新加速了资本主义生产方式的变化，推动了数字化、智能化方向的发展。",
                        "国际金融垄断资本主义的影响日益显现，金融垄断寡头化、国际化以及经济虚拟化、产业空心化成为显著特征。",
                        "社会阶级层级结构呈现出复杂性和多样化，贫富差距悬殊和社会阶层固化现象严重。",
                        "发达资本主义国家凭借经济、科技、文化传播等优势，在世界范围内推行霸权主义和强权政治。",
                        "21世纪以来资本主义的新变化并未改变其追求利润最大化的本性，反而放大了资本主义的系统性危机。"
                    ]
                },
                {
                    "index": 3,
                    "name": "第三节 资本主义的历史地位和发展趋势",
                    "type": "leaf",
                    "starting_page": 270,
                    "ending_page": 273,
                    "children": "",
                    "actual_starting_page": "page0279.txt",
                    "actual_ending_page": "page0282.txt",
                    "knowledge_points": [
                        "资本主义社会的产生、发展以及最终被更高级的社会制度所代替，都是由人类社会发展的一般规律决定的。",
                        "资本主义空前地提高了社会生产力，比以往任何社会都创造了更多的生产力。",
                        "资本主义将科学技术转变为强大的生产力，推动了社会生产力的发展。",
                        "资本追求剩余价值的内在动力和竞争的外在压力推动了社会生产力的迅速发展。",
                        "资本主义的意识形态和政治制度作为上层建筑，在保护、促进和完善资本主义生产方式方面起着重要作用，从而推动了社会生产力的迅速发展。",
                        "资本主义的基本矛盾即生产社会化与生产资料资本主义私人占有之间的矛盾，阻碍了社会生产力的进一步发展。",
                        "资本主义制度下财富占有两极分化，引发经济危机，严重影响社会生产的正常进行，阻碍社会生产力的发展。",
                        "资产阶级支配和控制资本主义经济和政治的发展和运行，不断激化社会矛盾和冲突。",
                        "资本主义基本矛盾决定了资本主义必然被社会主义所代替。"
                    ]
                }
            ],
            "actual_starting_page": "page0245.txt",
            "actual_ending_page": "page0279.txt"
        },
        {
            "index": 7,
            "name": "第六章 社会主义的发展及其规律",
            "type": "tree",
            "starting_page": 278,
            "ending_page": 314,
            "children": [
                {
                    "index": 1,
                    "name": "第一节 社会主义五百年的历史进程",
                    "type": "leaf",
                    "starting_page": 279,
                    "ending_page": 290,
                    "children": "",
                    "actual_starting_page": "page0288.txt",
                    "actual_ending_page": "page0299.txt",
                    "knowledge_points": [
                        "社会主义经过300多年长期探索，实现了从空想到科学的飞跃，在科学社会主义的指引下，社会主义实现了从理想到现实的飞跃，从一国到多国的发展。",
                        "空想社会主义产生于16世纪初期，到19世纪上半叶达到顶峰，经历了三个阶段：16到17世纪的早期空想社会主义、18世纪的空想平均共产主义、19世纪初期批判的空想社会主义。",
                        "空想社会主义的开山之作是1516年英国人托马斯·莫尔所著《乌托邦》一书，描绘了一个没有私有财产和剥削现象的理想社会。",
                        "19世纪初期以圣西门、傅立叶、欧文为代表的空想社会主义是科学社会主义的直接思想来源。",
                        "马克思、恩格斯创立了唯物史观和剩余价值学说，为实现社会主义从空想到科学的飞跃奠定了坚实的理论基础。",
                        "巴黎公社革命是无产阶级夺取政权的第一次伟大尝试，确立了无产阶级政权的原则。",
                        "列宁领导的俄国十月革命实现了社会主义从理想到现实的伟大飞跃，建立了世界上第一个人民当家作主的社会主义国家。",
                        "十月革命胜利后，苏维埃政权面临巩固政权和在经济文化相对落后的条件下建设社会主义的任务，列宁领导下的苏维埃俄国对社会主义道路进行了探索。",
                        "新经济政策的实施扭转了国家的严重危机，活跃了苏维埃的城乡经济，发展了生产，加强了苏维埃的社会主义经济基础。",
                        "苏联模式促进了社会主义制度的巩固和发展，推动了社会生产力的高速发展，但随着经济社会的发展，其弊端逐步显现。",
                        "第二次世界大战结束后，社会主义在世界范围内获得大发展，先后有一批国家走上社会主义道路。",
                        "东欧剧变、苏联解体的根本原因是放弃了社会主义道路、无产阶级专政、共产党的领导地位和马克思列宁主义。",
                        "中国共产党成功把中国特色社会主义推向21世纪，向世界展示了社会主义的优越性。"
                    ]
                },
                {
                    "index": 2,
                    "name": "第二节 科学社会主义基本原则",
                    "type": "leaf",
                    "starting_page": 293,
                    "ending_page": 304,
                    "children": "",
                    "actual_starting_page": "page0302.txt",
                    "actual_ending_page": "page0313.txt",
                    "knowledge_points": [
                        "科学社会主义基本原则是社会主义事业发展规律的集中体现，是马克思主义政党领导人民进行社会主义革命、建设、改革的基本遵循。",
                        "‘资本主义必然灭亡，社会主义必然胜利’是科学社会主义的核心命题，揭示了人类社会从资本主义向社会主义转变的历史必然性。",
                        "无产阶级是最先进最革命的阶级，肩负着推翻资本主义旧世界、建立社会主义和共产主义新世界的历史使命。",
                        "无产阶级革命是无产阶级进行斗争的最高形式，以建立无产阶级专政的国家政权为目的。",
                        "社会主义社会必须坚持生产资料公有制，生产的根本目的是满足全体社会成员的需要。",
                        "社会主义社会要有计划地指导和调节社会生产，并实行按劳分配原则。",
                        "社会主义社会要合乎自然规律地改造和利用自然，努力实现人与自然的和谐共生。",
                        "社会主义社会必须坚持科学的理论指导，大力发展社会主义先进文化。",
                        "无产阶级政党是无产阶级的先锋队，社会主义事业必须始终坚持无产阶级政党的领导。",
                        "社会主义社会要大力解放和发展生产力，逐步消灭剥削和消除两极分化，实现共同富裕和社会全面进步，并最终向共产主义社会过渡。",
                        "共产主义是人类最美好的社会制度，实现共产主义是共产党人的最高理想。",
                        "正确把握科学社会主义基本原则，既要始终坚持这些原则，又要善于将其与本国实际和时代特征相结合，创造性地解决实际问题。",
                        "中国特色社会主义既坚持了科学社会主义基本原则，又根据时代条件赋予其鲜明的中国特色，是科学社会主义在中国的运用和发展。"
                    ]
                },
                {
                    "index": 3,
                    "name": "第三节 在实践中探索社会主义的发展规律",
                    "type": "leaf",
                    "starting_page": 307,
                    "ending_page": 314,
                    "children": "",
                    "actual_starting_page": "page0316.txt",
                    "actual_ending_page": "page0323.txt",
                    "knowledge_points": [
                        "中国共产党通过加强全面领导和从严治党，找到了自我革命这一跳出治乱兴衰历史周期率的第二个答案。",
                        "习近平新时代中国特色社会主义思想标志着科学社会主义基本原则与当代中国实际和时代特征相结合的新境界。",
                        "社会主义建设在经济文化相对落后的国家是一个长期过程，需要大力发展生产力并逐步实现工业化和现代化。",
                        "社会主义国家在经济、政治、文化条件方面面临许多现实问题和困难，民主政治建设将是一个长期的过程。",
                        "国际环境对社会主义国家构成严峻挑战，要求社会主义国家尽快发展经济，提高综合国力以应对风险。",
                        "马克思主义执政党对社会主义发展道路的探索和建设规律的认识需要一个长期的过程。",
                        "社会主义发展道路具有多样性，各国应根据本国国情选择适合的发展道路。",
                        "历史文化传统的差异性是造成不同国家社会主义发展道路多样性的关键因素之一。",
                        "时代和实践的不断发展促使社会主义国家不断调整和选择适合本国国情的发展道路。",
                        "探索社会主义发展道路必须坚持科学态度对待马克思主义，并从本国实际情况出发。",
                        "社会主义事业需要大胆吸收和借鉴人类社会创造的一切优秀文明成果，但不能脱离本国国情照搬别国模式。",
                        "社会主义是在实践中开拓前进、不断发展的，需要尊重人民创造，集中人民智慧。",
                        "社会主义实践是一个不断探索的过程，需要紧跟时代步伐，顺应实践发展，不断深化对科学社会主义的认识。"
                    ]
                }
            ],
            "actual_starting_page": "page0287.txt",
            "actual_ending_page": "page0323.txt"
        },
        {
            "index": 8,
            "name": "第七章 共产主义崇高理想及其最终实现",
            "type": "tree",
            "starting_page": 323,
            "ending_page": 348,
            "children": [
                {
                    "index": 1,
                    "name": "第一节 展望未来共产主义新社会",
                    "type": "leaf",
                    "starting_page": 324,
                    "ending_page": 328,
                    "children": "",
                    "actual_starting_page": "page0333.txt",
                    "actual_ending_page": "page0337.txt",
                    "knowledge_points": [
                        "共产主义一词有三层含义：共产主义思想体系、共产主义运动和共产主义社会。",
                        "空想社会主义主要依靠猜测和想象的方法展望未来社会，而马克思主义经典作家则基于科学的方法论原则。",
                        "马克思主义经典作家站在科学的立场上，提出并自觉运用了预见未来社会的方法论原则。",
                        "马克思、恩格斯揭示了社会发展的一般规律和资本主义社会发展的特殊规律，从而对共产主义社会作出了科学的展望。",
                        "马克思、恩格斯在批判和剖析资本主义社会的过程中阐发未来新世界的特点。",
                        "共产主义不是教义，而是运动。它从事实出发，而不是从原则出发。",
                        "现实中的社会主义社会是共产主义社会的初级阶段，从社会主义社会中得到的启示更多、更直接、更有教益。",
                        "列宁领导十月革命后，探索了在俄国建设社会主义的道路，并取得了预见未来社会的实践经验。",
                        "马克思、恩格斯在展望未来社会时，只限于指出未来社会发展的方向、原则和基本特征，而不对各种细节作具体描绘。",
                        "共产主义社会的基本特征包括物质财富极大丰富，消费资料按需分配，人民精神境界极大提高，每个人自由而全面发展。"
                    ]
                },
                {
                    "index": 2,
                    "name": "第二节 实现共产主义是历史发展的必然趋势",
                    "type": "leaf",
                    "starting_page": 336,
                    "ending_page": 340,
                    "children": "",
                    "actual_starting_page": "page0345.txt",
                    "actual_ending_page": "page0349.txt",
                    "knowledge_points": [
                        "共产主义社会实现了人类解放，使人类从支配他们生活和命运的异己力量中解放出来，实现从必然王国向自由王国的飞跃。",
                        "共产主义理想是能够实现的理想，它基于对人类社会发展规律的认识，与空想有着本质区别。",
                        "共产主义理想的实现不是靠神秘的力量或奇迹，而是依靠社会的发展和进步以及人民群众的实践。",
                        "马克思主义通过对资本主义社会的研究，揭示了资本主义生产方式的特点及其自我否定的趋势，论证了资本主义的历史暂时性。",
                        "社会主义革命的胜利本身就是对共产主义理想可以实现的部分证明，因为社会主义社会是共产主义社会的初级阶段。",
                        "实现共产主义离不开无产阶级及其政党能动性的发挥、社会主义国家建设事业的推进及世界社会主义运动的发展。",
                        "无产阶级是先进生产力的代表，深受资产阶级剥削压迫，为争取自身解放进行了不懈斗争。",
                        "无产阶级的解放与全人类的解放是一致的，只有解放全人类才能彻底解放自己。",
                        "共产主义的实现是一个十分漫长且充满艰难曲折的历史过程，需要经历多个发展阶段。"
                    ]
                },
                {
                    "index": 3,
                    "name": "第三节 共产主义远大理想与中国特色社会主义共同理想",
                    "type": "leaf",
                    "starting_page": 343,
                    "ending_page": 348,
                    "children": "",
                    "actual_starting_page": "page0352.txt",
                    "actual_ending_page": "page0357.txt",
                    "knowledge_points": []
                }
            ],
            "actual_starting_page": "page0332.txt",
            "actual_ending_page": "page0357.txt"
        }
    ]
}